snlkuharlocal/src/Documents/ПроверкаПоставкиМаркированногоТовара/ПроверкаПоставкиМаркированногоТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроверкаПоставкиМаркированногоТовара</name>
  <basedOn>Document.ЛистНабора</basedOn>
  <attributes>
    <name>НоменклатураОсновная</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАгрегации</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗаводское</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНеверныхШтучныхКодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНеправильногоСодержимогоКоробки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтклонениеОтЗаводскогоКоличества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеПолныйКороб</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСканирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛинейныхШК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>Сканировщик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстQR</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>85</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставБригады</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/ТипыШтрихКодов/ТипыШтрихКодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШтрихКодов</name>
  <enumValues>
    <name>Штука</name>
    <comment>Штрих код штуки</comment>
  </enumValues>
  <enumValues>
    <name>Блочок</name>
    <comment>Штрих код блочка</comment>
  </enumValues>
  <enumValues>
    <name>Коробка</name>
    <comment>Штрих код коробки</comment>
  </enumValues>
  <enumValues>
    <name>Палета</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/КодыОперацийОстатки/КодыОперацийОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийОстатки</name>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>Закупка</name>
    <comment>Закупка</comment>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
    <comment>Продажа</comment>
  </enumValues>
  <enumValues>
    <name>Рекламация</name>
    <comment>Рекламация</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
    <comment>Возврат от покупателя</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>Перемещение</comment>
  </enumValues>
  <enumValues>
    <name>Пересортица</name>
    <comment>Пересортица</comment>
  </enumValues>
  <enumValues>
    <name>Списание</name>
    <comment>Списание</comment>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
    <comment>Оприходование</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Прочее</comment>
  </enumValues>
  <enumValues>
    <name>ЗакупкаР</name>
    <comment>Закупка (реальная)</comment>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
    <comment>Инвентаризация</comment>
  </enumValues>
  <enumValues>
    <name>Бонус</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
  <enumValues>
    <name>Комплектация</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСертификата</name>
  </enumValues>
  <enumValues>
    <name>Переоценка</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
    <comment>Возврат поставщику</comment>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКМ</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаШтрихкода</name>
    <type>
      <types>EnumRef.ТипыКодировокШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество в базовых единицах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Documents/ПроверкаПоставкиМаркированногоТовара/ManagerModule.bsl
#Область ТекстыЗапросов

Функция ТекстЗапроса_НайтиНоменклатуруПоОсновномуШК() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихКоды.Владелец КАК Номенклатура,
	|	ЕСТЬNULL(ШтрихКоды.Владелец.Родитель.ШтукВКоробке, 0) КАК ДополнительныйПараметр,
	|	ВЫБОР
	|		КОГДА ШтрихКоды.Владелец <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Успех
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	НЕ ШтрихКоды.ПометкаУдаления
	|	И (ШтрихКоды.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)  
	// +++ {Кузнецов Сергей Владимирович [06.05.2025] (HELP-4610)
	|			ИЛИ ШтрихКоды.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
	// }Кузнецов Сергей Владимирович +++ [06.05.2025]
	|	И ШтрихКоды.Наименование = &Данные";

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапроса_НайтиНоменклатуруШтукаЧЗ() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Упаковка.Владелец КАК Номенклатура,
	|	Упаковка.Ссылка КАК ДополнительныйПараметр,
	|	ВЫБОР
	|		КОГДА Упаковка.Владелец <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				И Упаковка.Ссылка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Успех
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК Упаковка
	|ГДЕ
	|	НЕ Упаковка.ПометкаУдаления
	|	И Упаковка.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	|	И Упаковка.Наименование = &Данные";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапроса_НайтиНоменклатуруКоробЧЗ() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Упаковка.Владелец КАК Номенклатура,
	|	Упаковка.Ссылка КАК ДополнительныйПараметр,
	|	ВЫБОР
	|		КОГДА Упаковка.Владелец <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				И Упаковка.Ссылка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Успех
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК Упаковка
	|ГДЕ
	|	НЕ Упаковка.ПометкаУдаления
	|	И Упаковка.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
	|	И Упаковка.Наименование = &Данные";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Поиск

///////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ТекстЗапроса = Документы.ПроверкаПоставкиМаркированногоТовара.ТекстЗапроса_НайтиНоменклатуруПоОсновномуШК();
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
Функция ПолучитьСтруктуруВозврата(Данные, ТекстЗапроса) Экспорт
	
	СтруктураВозврата = Новый Структура("Номенклатура, ДополнительныйПараметр, Успех", Неопределено, Неопределено, Ложь);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Данные", Данные);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция НайтиКоличествоЗаводское(КодАгрегации) Экспорт
	
	МассивНоменклатуры = Новый Массив;
	
	СтруктураВозврата = Новый Структура("КоличествоЗаводское, МассивНоменклатуры", 0, МассивНоменклатуры);
	
	Если НЕ ЗначениеЗаполнено(КодАгрегации) Тогда
		Сообщить("Не заполнен Код Агрегации!!!");
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодАгрегации", КодАгрегации);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ВложенныеШтрихкоды.Штрихкод) КАК КоличествоЗаводское
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШтрихкоды
	|ГДЕ
	|	ВложенныеШтрихкоды.Ссылка = &КодАгрегации";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		СтруктураВозврата.Вставить("КоличествоЗаводское", Выборка.КоличествоЗаводское);
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныеТовары.Номенклатура КАК Номенклатура,
	|	ВложенныеТовары.Количество КАК Количество
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеТовары КАК ВложенныеТовары
	|ГДЕ
	|	ВложенныеТовары.Ссылка = &КодАгрегации";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Количество() > 0 Тогда
	
		Пока Выборка.Следующий() Цикл
			СтруктураСтроки = Новый Структура("Номенклатура, Количество");
			СтруктураСтроки.Вставить("Номенклатура", Выборка.Номенклатура);
			СтруктураСтроки.Вставить("Количество", Выборка.Количество);
			МассивНоменклатуры.Добавить(СтруктураСтроки);
		КонецЦикла;
	
		СтруктураВозврата.Вставить("МассивНоменклатуры", МассивНоменклатуры);
	
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#Область Расчет

Функция КоличествоНеправильногоСодержимогоКоробки(НоменклатураОсновная, тзШтрихкодыУпаковок) Экспорт
	
	Если НЕ ЗначениеЗаполнено(НоменклатураОсновная) Тогда
		Сообщить("Не заполнена Номенклатура основная!!");
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НоменклатураОсновная", НоменклатураОсновная);
	Запрос.УстановитьПараметр("тзШтрихкодыУпаковок", тзШтрихкодыУпаковок);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзШтрихкодыУпаковок.ШтрихкодУпаковки КАК Справочник.ШтрихкодыУпаковокТоваров) КАК ШтрихкодУпаковки,
	|	1 КАК Количество
	|ПОМЕСТИТЬ вр_ШтрихкодыУпаковок
	|ИЗ
	|	&тзШтрихкодыУпаковок КАК тзШтрихкодыУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_ШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец КАК Номенклатура,
	|	СУММА(вр_ШтрихкодыУпаковок.Количество) КАК Количество
	|ПОМЕСТИТЬ тзвр_ШтрихкодыУпаковок
	|ИЗ
	|	вр_ШтрихкодыУпаковок КАК вр_ШтрихкодыУпаковок
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(вр_ШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец) = ТИП(Справочник.Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	вр_ШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тзвр_ШтрихкодыУпаковок.Номенклатура КАК Номенклатура,
	|	СУММА(тзвр_ШтрихкодыУпаковок.Количество) КАК Количество
	|ПОМЕСТИТЬ вр_Количество
	|ИЗ
	|	тзвр_ШтрихкодыУпаковок КАК тзвр_ШтрихкодыУпаковок
	|ГДЕ
	|	тзвр_ШтрихкодыУпаковок.Номенклатура <> &НоменклатураОсновная
	|
	|СГРУППИРОВАТЬ ПО
	|	тзвр_ШтрихкодыУпаковок.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(вр_Количество.Количество) КАК КоличествоНеправильногоСодержимогоКоробки
	|ИЗ
	|	вр_Количество КАК вр_Количество";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КоличествоНеправильногоСодержимогоКоробки;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

Функция ОтклонениеОтЗаводскогоКоличества(КоличествоЗаводское, тзШтрихкодыУпаковок) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("тзШтрихкодыУпаковок", тзШтрихкодыУпаковок);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзШтрихкодыУпаковок.ШтрихкодУпаковки КАК Справочник.ШтрихкодыУпаковокТоваров) КАК ШтрихкодУпаковки,
	|	1 КАК Количество
	|ПОМЕСТИТЬ вр_ШтрихкодыУпаковок
	|ИЗ
	|	&тзШтрихкодыУпаковок КАК тзШтрихкодыУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_ШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец КАК Номенклатура,
	|	СУММА(вр_ШтрихкодыУпаковок.Количество) КАК Количество
	|ПОМЕСТИТЬ тзвр_ШтрихкодыУпаковок
	|ИЗ
	|	вр_ШтрихкодыУпаковок КАК вр_ШтрихкодыУпаковок
	|
	|СГРУППИРОВАТЬ ПО
	|	вр_ШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(тзвр_ШтрихкодыУпаковок.Количество) КАК КоличествоШК
	|ИЗ
	|	тзвр_ШтрихкодыУпаковок КАК тзвр_ШтрихкодыУпаковок";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		Возврат КоличествоЗаводское - Выборка.КоличествоШК;
	КонецЦикла;
	
	Возврат КоличествоЗаводское;
	
КонецФункции

Функция КоличествоНеверныхШтучныхКодов(КодАгрегации, тзШтрихкодыУпаковок) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КодАгрегации) Тогда
		Сообщить("Не заполнен Код Агрегации!!!");
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодАгрегации", КодАгрегации);
	Запрос.УстановитьПараметр("тзШтрихкодыУпаковок", тзШтрихкодыУпаковок);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзШтрихкодыУпаковок.ШтрихкодУпаковки КАК Справочник.ШтрихкодыУпаковокТоваров) КАК ШтрихкодУпаковки,
	|	1 КАК Количество
	|ПОМЕСТИТЬ вр_ШтрихкодыУпаковок
	|ИЗ
	|	&тзШтрихкодыУпаковок КАК тзШтрихкодыУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_ШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	вр_ШтрихкодыУпаковок.Количество КАК Количество
	|ПОМЕСТИТЬ вт_Штрихкоды
	|ИЗ
	|	вр_ШтрихкодыУпаковок КАК вр_ШтрихкодыУпаковок
	|ГДЕ
	|	НЕ вр_ШтрихкодыУпаковок.ШтрихкодУпаковки В
	|				(ВЫБРАТЬ
	|					ВложенныеШтрихкоды.Штрихкод КАК ШтрихкодыАгрегации
	|				ИЗ
	|					Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШтрихкоды
	|				ГДЕ
	|					ВложенныеШтрихкоды.Ссылка = &КодАгрегации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(вт_Штрихкоды.Количество) КАК КоличествоНеверныхШтучныхКодов
	|ИЗ
	|	вт_Штрихкоды КАК вт_Штрихкоды";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КоличествоНеверныхШтучныхКодов;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыиФункции
//++Данилова Е.В. 05.05.2026 SNL-219 
Функция НайтиЛистПоКодуАгрегации(Знач КодАгрегации) Экспорт 
	Если Не ЗначениеЗаполнено(КодАгрегации) Тогда
		Возврат Неопределено; 
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛистНабора.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛистНабора КАК ЛистНабора
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|		ПО (ПриходнаяНакладная.Ссылка = ЛистНабора.ДокОснование)
		|			И (ПриходнаяНакладная.Проведен)
		|			И (ПриходнаяНакладная.КодОперации = &КодОперации)
		|ГДЕ
		|	ЛистНабора.КодАгрегации = &КодАгрегации
		|	И ЛистНабора.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛистНабора.Ссылка
		|ИЗ
		|	Документ.ЛистНабора КАК ЛистНабора
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|		ПО (ПриходнаяНакладная.Ссылка = ЛистНабора.ДокОснование)
		|			И (ПриходнаяНакладная.Проведен)
		|			И (ПриходнаяНакладная.КодОперации = &КодОперации)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|		ПО (ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка)
		|ГДЕ
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = &КодАгрегации
		|	И ЛистНабора.Проведен";
	
	Запрос.УстановитьПараметр("КодАгрегации", КодАгрегации);
	Запрос.УстановитьПараметр("КодОперации", Перечисления.КодыОперацийОстатки.ЗакупкаР);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ссылка; 
	КонецЕсли;
	
	Возврат неопределено; 


КонецФункции // НайтиЛистПоКодуАгрегации()

//--Данилова Е.В. 05.05.2026 
#КонецОбласти
